import { Article } from '../../lib/api';

export const mockArticles: Array<Article> = [
  {
    id: 1,
    title: 'Поступай в ПГНИУ. Как это работает: Институт компьютерных наук и технологий',
    description: 'Поступай в ПГНИУ. Как это работает: Институт компьютерных наук и технологий',
    date: '22.06.2023',
  },
  {
    id: 2,
    title: 'Пермский университет создает Институт компьютерных наук и технологий',
    description: 'Пермский университет создает Институт компьютерных наук и технологий',
    date: '17.05.2023',
  },
  {
    id: 3,
    title: 'Проректором Пермского университета по учебной работе назначена Елена Бабушкина',
    description: 'Проректором Пермского университета по учебной работе назначена Елена Бабушкина',
    date: '12.05.2023',
  },
  {
    id: 4,
    title: 'Студенты юридического факультета ПГНИУ стали участниками игр живого действия',
    description: 'Студенты юридического факультета ПГНИУ стали участниками игр живого действия',
    date: '12.03.2023',
  },
  {
    id: 5,
    title: 'Поступай в ПГНИУ. Как это работает: Институт компьютерных наук и технологий',
    description: 'Поступай в ПГНИУ. Как это работает: Институт компьютерных наук и технологий',
    date: '28.02.2023',
  },
  {
    id: 6,
    title: 'Пермский университет создает Институт компьютерных наук и технологий',
    description: 'Пермский университет создает Институт компьютерных наук и технологий',
    date: '17.02.2023',
  },
];
