import { Article } from './../../api';

export const mockArticles: Array<Article> = [
  {
    id: 1,
    title: 'Поступай в ПГНИУ. Как это работает: Институт компьютерных наук и технологий',
    content: 'Поступай в ПГНИУ. Как это работает: Институт компьютерных наук и технологий',
    datetime: '2023-06-22',
    author: 'Flatline',
    comments: [],
  },
  {
    id: 2,
    title: 'Пермский университет создает Институт компьютерных наук и технологий',
    content: 'Пермский университет создает Институт компьютерных наук и технологий',
    datetime: '2023-05-17',
    author: 'Flatline',
    comments: [],
  },
  {
    id: 3,
    title: 'Проректором Пермского университета по учебной работе назначена Елена Бабушкина',
    content: 'Проректором Пермского университета по учебной работе назначена Елена Бабушкина',
    datetime: '2023-05-12',
    author: 'Flatline',
    comments: [],
  },
  {
    id: 4,
    title: 'Студенты юридического факультета ПГНИУ стали участниками игр живого действия',
    content: 'Студенты юридического факультета ПГНИУ стали участниками игр живого действия',
    datetime: '2023-03-12',
    author: 'Flatline',
    comments: [],
  },
  {
    id: 5,
    title: 'Поступай в ПГНИУ. Как это работает: Институт компьютерных наук и технологий',
    content: 'Поступай в ПГНИУ. Как это работает: Институт компьютерных наук и технологий',
    datetime: '2023-02-28',
    author: 'Flatline',
    comments: [],
  },
  {
    id: 6,
    title: 'Пермский университет создает Институт компьютерных наук и технологий',
    content: 'Пермский университет создает Институт компьютерных наук и технологий',
    datetime: '2023-02-17',
    author: 'Flatline',
    comments: [],
  },
];
