export const programOptions = [
  {
    title: 'форма обучения',
    value: 'Очная',
  },
  {
    title: 'длительность',
    value: '4 года',
  },
  {
    title: 'язык обучения',
    value: 'Русский',
  },
  {
    title: 'общежитие',
    value: 'Да',
  },
  {
    title: 'военный учебный центр',
    value: 'Нет',
  },
  {
    title: 'гос. аккредитация',
    value: 'Да',
  },
];

export const companies = [
  {
    id: 0,
    link: 'https://tinkoff.ru',
    imgSrc: require('@/assets/img/companies/tink.svg'),
  },
  {
    id: 1,
    link: 'https://vk.com',
    imgSrc: require('@/assets/img/companies/vk.svg'),
  },
  {
    id: 2,
    link: 'https://alfabank.ru/',
    imgSrc: require('@/assets/img/companies/alpha.svg'),
  },
  {
    id: 3,
    link: 'https://mail.ru',
    imgSrc: require('@/assets/img/companies/mail.svg'),
  },
  {
    id: 4,
    link: 'https://youla.ru',
    imgSrc: require('@/assets/img/companies/ula.svg'),
  },
  {
    id: 5,
    link: 'https://www.wildberries.ru/',
    imgSrc: require('@/assets/img/companies/wb.svg'),
  },
  {
    id: 6,
    link: 'https://www.rambler.ru/',
    imgSrc: require('@/assets/img/companies/rambl.svg'),
  },
  {
    id: 7,
    link: 'https://delivery-club.ru',
    imgSrc: require('@/assets/img/companies/delivery.svg'),
  },
];

export const reviews = [
  {
    id: 0,
    text: 'Образовательная программа познакомила меня с самыми разными аспектами IT индустрии, такими как базы данных, операционные системы, языки программирования и многими другими. Это позволило и позволяет до сих пор быстро овладевать новыми инструментами и постоянно повышать свою квалификацию как специалиста, так как обучение сформировало мне прочную и систематизированную базу. Фундаментальность полученного образования обеспечила мне уверенный и устойчивый карьерный рост и возможность решать сложные задачи из самых разных областей, такие как: интегрирование разнородных наукоёмких систем, автоматизация и сопровождение процессов разработки ПО, непосредственное участие в разработке сложного многофункционального ПО и многие другие.',
    author: 'Евгений Носовицкий',
    year: 'выпускник 2016',
  },
  {
    id: 1,
    text: 'Я поступал на направление "Информационные системы и технологии", обучаясь программированию и IT до этого всего год, следовательно, моих знаний с натяжкой хватало на сдачу ЕГЭ. За 4 года обучения языкам программирования, базам данных, администрированию операционных систем, методам разработки ПО и прочим дисциплинам я пришел к должности middle-разработчика на Java. Я считаю, что в этом заслуга исключительно преподавателей, которые меня обучали, за что всегда буду безумно им благодарен. Кроме усердной учебы также всегда хватало времени на развлечения, встречи с друзьями и собственные хобби. Подводя итог, мой факультет дал мне карьеру, друзей и направление, в котором нужно дальше двигаться. И вот за это все я благодарен своему факультету!',
    author: 'Олег Бутенко',
    year: 'выпускник 2021',
  },
  {
    id: 2,
    text: 'Когда я думал, куда поступать после школы, на первом месте в моём списке стоял ИТМО ФИТиП. Я отучился здесь в бакалавриате и в магистратуре. Нельзя не отметить высокий уровень преподавания, глубокое погружение в теорию и много практических работ, в том числе проекты в командах. Еще когда я учился в бакалавриате, нас учили работать в команде. Обучение требовало большого количества времени и усилий, но результаты того стоят. Еще в бакалавриате я начал работать программистом, а сейчас я работаю во ВКонтакте старшим разработчиком.',
    author: 'Александр Демин',
    year: 'выпускник 2017',
  },
];

export const faq = [
  {
    id: 0,
    question: 'Где и когда можно узнать проходные баллы в текущем году',
    answer: 'Проходной балл определяется только по завершению срока подачи документов и конкурсной ситуации текущего года. Вам необходимо самостоятельно отслеживать конкурсную ситуацию на данном сайте и оценивать свои шансы.',
  },
  {
    id: 1,
    question: 'Можно ли подать документы в электронном виде',
    answer: 'Проходной балл определяется только по завершению срока подачи документов и конкурсной ситуации текущего года. Вам необходимо самостоятельно отслеживать конкурсную ситуацию на данном сайте и оценивать свои шансы.',
  },
  {
    id: 2,
    question: 'Возможно ли перевестись с контрактного обучения на бюджетное',
    answer: 'Проходной балл определяется только по завершению срока подачи документов и конкурсной ситуации текущего года. Вам необходимо самостоятельно отслеживать конкурсную ситуацию на данном сайте и оценивать свои шансы.',
  },
];
